tests/load/artillery.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      name: "Warm up"
    - duration: 120
      arrivalRate: 50
      name: "Sustained load"
    - duration: 60
      arrivalRate: 100
      name: "Peak load"
  processor: "./tests/load/processor.js"

scenarios:
  - name: "Create and check job"
    flow:
      - post:
          url: "/api/v1/jobs"
          json:
            fileUrl: "https://www.w3.org/WAI/ER/tests/xhtml/testfiles/resources/pdf/dummy.pdf"
            userId: "load-test-user"
          capture:
            json: "$.data.jobId"
            as: "jobId"
      - get:
          url: "/api/v1/jobs/{{ jobId }}"
      - think: 2
      - get:
          url: "/api/v1/jobs?page=1&limit=10"